title: Wscript Connected to Port 25
id: 06d71506-7beb-4f22-8888-e2e5e2ca7666
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    Image|endswith: '\wscript.exe'
    Initiated: 'true'
    DestinationPort:
      - 25
  condition: selection