title: Local Account Activity
id: d5ab8165-4bbb-4db3-9368-e4ecdc4166ff
status: test
description: Detects suspicious local account activity by looking for Windows Event ID 4624.
author: Victor Fernandez III
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        LogonType:
        - 2
        - 3
        - 10
    filter:
        TargetUserName: 'Administrator'
    condition: selection and not filter
level: medium